uploads/xml/Travelport-Request-662d76d79d4dd-4646.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <air:LowFareSearchReq xmlns:air="http://www.travelport.com/schema/air_v51_0" xmlns:com="http://www.travelport.com/schema/common_v51_0" SolutionResult="false" TargetBranch="P3763969" TraceId="c69cb585044f29b6b7e1b5a5007dd39e">
      <com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="SVO"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="NAS"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2024-04-29"/>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Economy"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:AirSearchModifiers>
        <air:PreferredProviders>
          <com:Provider Code="1G"/>
        </air:PreferredProviders>
      </air:AirSearchModifiers>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <air:AirPricingModifiers CurrencyType="SAR"/>
    </air:LowFareSearchReq>
  </soapenv:Body>
</soapenv:Envelope>
